{"model_config":{"class_name":"Sequential","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"ragged":false,"name":"conv2d_input"}},{"class_name":"Conv2D","config":{"name":"conv2d","trainable":true,"batch_input_shape":[null,28,28,1],"dtype":"float32","filters":16,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"MaxPooling2D","config":{"name":"max_pooling2d","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","activation":null}},{"class_name":"Conv2D","config":{"name":"conv2d_1","trainable":true,"dtype":"float32","filters":36,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"MaxPooling2D","config":{"name":"max_pooling2d_1","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","activation":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":"float32","rate":0.25,"noise_shape":null,"seed":null,"activation":null,"data_format":null,"padding":null}},{"class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":"float32","data_format":"channels_last","activation":null,"padding":null}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"data_format":null,"padding":null}},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":"float32","rate":0.5,"noise_shape":null,"seed":null,"activation":null,"data_format":null,"padding":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"data_format":null,"padding":null}}]}},"conv2d":{"kernel":[[[[0.1948907,-0.1469393,0.1662046,-0.02677367,-0.03027689,0.1786462,-0.3018703,-0.0548023,0.0658526,-0.03068631,0.00380251,-0.06318951,0.07389051,-0.0759422,0.03911677,-0.1319429]],[[0.2043286,0.07758481,0.008608708,0.07047542,0.1758524,0.0571444,-0.09397005,-0.06928222,0.05773503,0.01126046,0.1702955,-0.2504882,-0.06492312,0.09029056,-0.07407459,-0.1285498]],[[0.1636231,-0.06051617,0.0310156,0.1342765,-0.149296,0.1217082,-0.1948032,-0.206518,0.2841919,0.04834954,0.1088903,-0.2878519,0.03979751,0.04700897,0.1235429,-0.1023309]],[[0.04546642,0.02888685,-0.1977743,0.2980757,-0.4088295,-0.1629206,0.1105072,-0.02412071,0.3025977,0.03512438,0.1437278,-0.1381145,0.1203153,0.2284246,0.01642301,-0.01612501]],[[0.02775794,0.06364565,-0.07474992,0.1378293,-0.1497218,-0.2398549,0.02311566,0.1839099,0.2104064,-0.1141179,-0.0551134,0.006263617,-0.02384256,0.07924,-0.04073701,0.1639172]]],[[[-0.01316993,0.1528371,0.1144304,0.1559103,-0.1485429,0.1548993,-0.3657219,0.1684919,-0.1099683,0.186924,0.1021016,-0.05625747,-0.06493001,-0.01648469,0.0818213,-0.185841]],[[0.0589301,-0.03621526,0.07416917,0.2774321,0.201335,0.1588134,-0.1161309,0.04445972,-0.08355223,0.0917494,0.1634046,-0.08876174,0.06452078,0.08144463,0.1573628,-0.2589801]],[[0.04123042,0.08816614,-0.1958738,0.2132542,0.08691396,0.003105247,0.1484054,-0.2304201,0.08585903,-0.1138854,0.1868597,-0.08861029,0.1322884,0.08036177,0.08219559,-0.1937863]],[[0.1227392,-0.08959809,-0.2770254,0.1281242,0.02041644,-0.1495455,0.2665653,-0.326755,0.1287093,-0.1612071,0.2164221,-0.05793356,0.04458879,-0.03446653,0.2284448,0.09414273]],[[0.1469189,-0.09079532,0.09613413,-0.1784343,-0.05343419,-0.2842838,0.1050432,-0.1846175,0.1281922,-0.1391942,0.1047993,-0.1470349,-0.06344941,-0.1719858,0.02755684,0.08918051]]],[[[-0.2050228,0.1528352,0.2052395,0.2514191,-0.1064071,0.07634402,-0.0881076,0.1203974,-0.232604,0.1531588,-0.06261418,0.1539021,0.1172628,-0.08066124,0.1835147,-0.263323]],[[-0.3181667,0.06182833,-0.3966828,0.1463578,0.01676901,0.1735038,0.1983771,0.08293866,-0.1778638,-0.01830848,-0.1860476,-0.02648047,0.1377015,0.05061596,0.1716927,-0.2383142]],[[-0.1645426,0.05800803,-0.4258198,0.009706947,0.2540667,0.1211705,0.1589557,-0.1064811,-0.1681032,0.03736172,-0.01669931,-0.0736958,-0.0845139,0.08729255,0.1593239,0.01003695]],[[-0.187439,-0.06557684,-0.08415199,-0.2669117,0.08194175,-0.1641921,0.04225768,-0.3437586,0.2018415,-0.06138609,0.06530734,-0.05855929,-0.02673737,-0.008464058,0.2229831,0.008310033]],[[-0.1657404,0.03382766,0.2388638,-0.2488776,0.1655297,-0.2062433,-0.08832054,-0.2730618,0.29609,-0.2018683,0.1847365,0.01325441,-0.002507382,-0.2761758,0.2062571,0.1887607]]],[[[-0.1524377,-0.2106932,0.09238566,0.1058509,0.19679,0.151398,0.1997515,0.1626136,-0.2123628,0.09756178,-0.0831567,0.1887341,0.1073392,-0.1237511,-0.1550853,-0.2121888]],[[-0.2852868,0.04333847,-0.482475,-0.1962339,0.1024094,0.07646129,0.07441491,0.1144233,-0.1943257,-0.03515329,-0.3320786,0.2375923,0.1137873,0.2021791,-0.08786711,-0.1268565]],[[-0.2565889,0.02787697,-0.08845204,-0.2305133,0.003067539,0.06855642,0.1077796,0.2505329,-0.2659945,-0.08726712,-0.1135731,0.2085382,-0.109965,-0.006682552,-0.2058107,-0.04172387]],[[-0.1923602,0.09267783,0.10034,-0.2888081,0.1944057,-0.05427458,-0.02450345,0.04842334,-0.1791661,0.1215368,0.05379135,0.0274298,0.1082751,-0.2001173,-0.1323099,0.2288556]],[[-0.09139301,0.09551609,0.2725027,-0.1104022,0.05030014,-0.1485662,-0.007755598,0.04555282,0.1310138,-0.02196016,0.008967059,-0.0589878,0.1402647,-0.3047827,0.07131304,0.2326021]]],[[[0.1124797,-0.2072337,-0.08670389,-0.1857332,-0.1216494,0.0515562,0.2076084,0.0311166,-0.06199712,0.08634772,-0.1590616,-0.04623181,-0.1165298,0.05271292,-0.04834549,-0.1898648]],[[0.2874928,0.06512742,-0.2354236,-0.0748686,-0.1846059,0.1113377,0.1793377,0.1450085,-0.1944866,0.1583411,-0.08805664,0.1091117,-0.04646037,0.1666483,-0.2372248,-0.05189884]],[[0.1345857,0.1107348,0.003414616,-0.2655903,-0.1567692,-0.001312516,-0.09525853,0.2103576,-0.2184118,0.06304096,-0.2094535,0.1144971,0.1592192,0.1453675,-0.2487847,0.176495]],[[0.1869526,0.1232473,0.1437947,0.05359797,-0.1226848,0.06252448,-0.05600633,0.2296676,-0.06725496,0.1469434,-0.2685756,0.1705251,-0.0395432,0.02823126,-0.2698441,0.2206776]],[[0.02564579,0.03429458,0.1680101,0.08200669,-0.02375517,0.04723179,-0.2182184,-0.009268545,0.01723159,0.09603214,0.03367011,0.1465494,0.07738008,-0.01337788,-0.1224191,0.1642943]]]],"bias":[0.01278729,-0.03275592,0.03394251,0.0198399,-0.003167976,-0.03529014,-0.0108353,-0.009330078,0.004204504,-0.02869095,-0.001051644,0.01676617,-0.04315347,-0.02340599,0.007878375,-0.001764285]},"conv2d_1":{"kernel":[[[[-0.03969305,-0.07749356,-0.2140089,0.118795,-0.05825863,0.04247111,0.1764032,-0.0685688,-0.06792835,-0.1222294,0.008138361,0.1891048,0.09568474,0.003845071,-0.04035716,-0.2345968,-0.203413,-0.06320748,-0.272815,-0.002012071,-0.2303211,-0.0934939,0.07448641,-0.2572623,-0.2016604,0.1674993,0.04897156,-0.1424443,-0.04180763,0.03079095,-0.1194525,-0.1208809,0.1910304,-0.09995267,-0.03851531,-0.1675949],[-0.08202315,0.007510968,0.02346427,-0.03035773,-0.059219,-0.1346849,-0.07337189,-0.1015409,-0.02198111,0.002870908,-0.04749062,-0.09329627,-0.1539107,0.02604061,-0.04035451,0.107449,-0.02925113,0.02809354,0.02327417,0.0577608,0.00619834,-0.07004412,-0.02717378,-0.007438664,-0.01427108,-0.01081935,-0.0781009,0.05950472,0.05526678,0.03629294,0.01081431,-0.02217896,-0.1495716,0.03741024,-0.04797745,0.05807268],[0.03015029,-0.1520006,0.1020564,-0.0760141,0.00151581,-0.009117471,0.1583584,0.1077663,0.08403323,0.2103341,-0.01357341,0.05090396,-0.02990863,-0.1796076,0.001344362,0.02133947,0.2857021,-0.1013952,0.09146304,-0.01861984,0.03059355,-0.009712722,0.02037609,-0.01969832,0.24848,0.1184233,0.1266644,5.129908E-05,-0.01998584,0.07160817,-0.2008711,0.1570104,-0.1508759,0.1648982,-0.04382977,0.1237547],[-0.005019542,-0.04592373,-0.01551955,-0.0471369,0.0610803,-0.1327512,-0.02407896,0.05682594,0.004402262,0.06810325,0.06564207,-0.04925994,-0.1085906,-0.05895463,-0.08054671,0.08112977,0.07723912,-0.007117889,0.02064356,-0.07855842,-0.05448349,0.109505,0.04961117,0.08829322,-0.03030267,-0.02938185,0.03312969,-0.06687576,0.05430607,0.004282595,-0.07813415,0.00211839,-0.1644604,0.03403168,-0.09031859,-0.1258528],[-0.03076168,-0.08056083,0.02931068,0.02339292,-0.02411245,-0.01339172,-0.2526088,0.1581117,0.04327117,0.01976515,0.05190481,-0.02907759,0.02626423,-0.0725513,-0.1704775,-0.06719067,-0.1416639,-0.1183688,-0.09309858,0.03771133,-0.03330775,-0.05904257,0.06666067,-0.09026188,-0.1583153,0.008180557,0.04808954,0.0025636,0.1382488,0.05754893,0.1560412,-0.1389461,-0.05172377,0.06186383,0.009802021,-0.1315965],[0.009977593,-0.1430098,-0.09972778,0.008584464,0.03905547,-0.06518649,-0.05602214,0.1543503,0.0303221,-0.01153813,-0.03848717,-0.06645819,-0.05646204,0.03153524,0.08659668,0.03740186,0.02487898,-0.0770375,0.05358768,-0.1261216,0.03097592,-0.1682868,0.01074363,0.09347185,0.07135282,0.06215893,-0.04564722,-0.001744858,-0.0210895,-0.09399048,0.006955499,0.1175067,-0.07980701,0.022131,0.05076592,-0.0908897],[-0.1932995,0.1257206,0.09967725,0.06032508,0.01512326,-0.04111104,0.09921593,-0.02861432,0.05632715,0.15209,-0.01103195,-0.08912925,-0.003092319,-0.1176849,-0.107465,-0.05953579,0.06933519,0.1379333,-0.0318724,-0.00458066,0.04429356,0.1830963,-0.05817482,0.09711005,0.03390605,-0.04672518,0.08046556,0.09758951,0.0226179,0.06281402,0.08687567,-0.00769294,-0.1404692,0.1217425,0.07051719,-0.04078426],[-0.04724094,-0.06977095,-0.04721872,0.07053252,-0.05926407,0.1229215,-0.01176934,0.1216325,0.06222198,-0.01559149,-0.1265156,0.02045945,-0.09389152,0.1356324,0.002950988,0.08988923,-0.1785216,0.03792243,-0.09962379,0.04483958,-0.09522116,-0.1259251,-0.0535896,-0.03416481,-0.0532218,0.06128145,-0.02199132,-0.1570451,0.05563741,-0.01478235,-0.05249177,0.03104427,-0.06022964,0.04113395,0.1195387,-0.05655955],[0.1398799,-0.032664,-0.06629428,-0.02137656,0.004795427,0.07890828,-0.06402538,0.06339038,0.001792743,-0.0862583,0.1344673,-0.2134807,0.1853484,0.03686291,-0.04602465,-0.009246622,0.009832983,-0.07686479,-0.09213558,-0.07140985,-0.1351984,-0.1419854,0.1408323,-0.1071464,-0.161501,-0.05245847,-0.1631285,0.02322556,0.07071189,0.04962562,0.09908787,0.0137408,0.1355857,-0.07132602,-0.03382035,-0.04674029],[-0.006006504,-0.0305199,-0.05728659,0.07486551,-0.06155793,-0.08125678,-0.04878027,0.07129055,-0.02194014,-0.1146975,-0.1062868,-0.0006564501,-0.1487201,0.04365725,-0.0110168,-0.03153724,-0.1550362,-0.09166489,0.04806951,0.03648173,-0.02172425,-0.04461549,-0.08368786,-0.007830596,-0.06543198,0.1162801,-0.02485725,-0.04759671,-0.03805853,-0.08439028,0.003128062,0.114474,-0.1459132,-0.01798317,0.04608766,0.03236418],[0.02048145,-0.01443956,-0.1092526,0.01303751,0.01183322,0.02879319,-0.2035746,-0.005335675,0.09727179,-0.06200529,0.1154096,-0.07741755,0.1212239,0.01345457,-0.03789327,-0.03927267,-0.08878251,-0.1652126,-0.1449074,-0.003887764,-0.08501237,-0.1916571,0.1380471,-0.1600697,-0.2470521,-0.03755359,-0.1220317,0.01352751,-0.04156002,0.04147778,0.176886,-0.1369282,0.07273239,-0.03454173,-0.01129073,0.04666088],[-0.2359775,-0.03830753,-0.03435532,0.02778514,-0.01234366,0.1583438,-0.06681397,-0.05268412,-0.02106238,0.04703952,-0.1680201,-0.06427246,0.01562023,-0.001067222,0.02449579,-0.1130833,0.07420427,0.09533421,-0.1340825,0.1357357,-0.1469413,-0.06872447,-0.06453071,-0.1091372,-0.05911602,0.1478616,-0.06010061,-0.1293065,0.1252745,0.02995562,-0.1012883,-0.165825,0.0695155,-0.01444836,0.09412151,-0.09700815],[-0.0578798,0.04158918,0.003394831,-0.01580224,0.08110231,-0.1078554,-0.1193221,0.06942057,-0.006556707,-0.04875305,-0.01988637,-0.08057844,-0.06070688,-0.02146897,-0.0289706,0.08267301,-0.0355746,-0.06009187,-0.04947691,-0.04462053,-0.04515422,0.03171077,-0.04176524,0.07898307,-0.09352154,0.03253838,0.002985886,0.09715144,0.03334856,0.006907615,-0.01022654,0.086146,-0.1232949,0.03197648,-0.03931257,-0.002878832],[0.07618926,-0.04018918,0.01730948,0.02759512,-0.06291226,0.009388724,0.04102443,0.1102303,-0.01534704,0.06749612,-0.07348059,-0.0762495,0.01022426,0.1316201,0.06433074,0.05324397,0.008393588,-0.006552742,0.06380283,0.01176328,0.06612977,0.03131641,0.006979219,-0.01237502,-0.07577468,-0.02553364,-0.01754742,-0.004816913,-0.06490339,-0.06663297,0.03176902,0.04390134,-0.1771333,-0.01237449,0.06025344,-0.1134573],[-0.09733802,-0.06780039,-0.08047672,0.03378303,0.1161031,0.03977872,-0.1168795,0.1060103,0.02707619,-0.06551717,0.06755839,-0.1361516,0.07083958,-0.002178499,-0.0324536,-0.1445224,-0.0690386,-0.07695352,-0.203988,0.008999857,-0.09265096,-0.09811474,0.1132749,-0.05690487,-0.146649,-0.052949,-0.0220412,0.06479693,-0.009989271,0.1234376,0.120157,-0.04144267,-0.1000572,-0.04807599,0.05973159,0.009472809],[-0.038253,0.01633188,0.02272332,-0.08943447,0.03069844,0.07413687,0.1245483,-0.1024699,0.03203792,0.1361608,0.06386765,-0.008549112,0.1399068,-0.1484811,-0.001818857,0.1612062,0.1822817,0.1241856,0.01633886,0.07092872,0.02204015,0.02165792,-0.01651322,0.04805877,0.1021083,0.08060508,-0.06857532,0.0397912,0.05324256,0.01141345,-0.02958814,0.1079828,-0.1993359,0.04893972,-0.1287281,0.02176027]],[[-0.008104361,-0.1993861,-0.1586731,0.1159304,0.04672607,-0.1092309,0.3029604,-0.03516787,-0.08134029,-0.01425123,0.07979874,0.02982056,-0.0673639,0.03681148,-0.05233049,-0.04240328,-0.119397,-0.1183392,-0.2641084,-0.006640306,-0.2717623,0.1094745,0.1335177,-0.2342295,-0.1855789,0.1196267,0.1033924,-0.2685554,0.03963942,-0.02460484,-0.1713847,-0.03547329,0.1557671,0.05873711,0.08441202,-0.1295248],[-0.1125721,-0.06247482,-0.07737218,0.002580885,0.09697244,-0.006555727,-0.07958762,-0.04177944,-0.02431294,0.02177601,0.03772635,-0.06494533,-0.006483029,-0.03987444,-0.1278457,-0.08264416,-0.03577502,-0.03311057,-0.0160806,0.02112,0.02483825,-0.009205465,0.02500647,0.02473519,-0.1152741,0.0101991,0.01237064,0.05962586,0.01056175,0.06375468,0.1022417,-0.04381458,-0.08852828,0.05155964,0.07518782,0.003027963],[-0.03168969,-0.08173084,0.08506484,-0.006864077,0.004571581,0.1185025,-0.01635963,-0.0362476,0.04755266,0.1230498,-0.1000822,-0.009623683,-0.02165764,-0.173897,-0.06975713,0.01445885,0.3250026,0.02874845,0.1555097,-0.05693127,0.06337332,-0.03498641,-0.1593131,-0.05997215,0.2723595,-0.1468471,0.100209,0.127409,0.03762029,-0.04428232,-0.03715954,0.04566457,-0.2901746,0.05468464,-0.007805868,-0.04545238],[-0.0007522815,0.0113809,0.1241916,-0.1105125,0.009201359,-0.1102395,0.1789645,0.006704481,0.05643486,0.09117559,0.04664146,-0.1415329,0.02162601,-0.08464303,0.03621551,0.01609239,0.04074266,0.02966448,0.06482311,-0.05562908,0.03091356,0.231876,0.01820856,-0.01045367,0.1274258,0.01576134,0.05971877,-0.1138741,-0.0618161,0.01472917,-0.02132647,-0.0136859,-0.1327418,-0.06532734,-0.08659381,0.06752852],[-0.1247837,-0.0670479,0.003874134,-0.05766792,0.008138867,-0.06349144,-0.2327412,-0.02581606,0.07383511,0.01777242,0.0578201,-0.08754903,0.1169889,-0.141068,-0.2982832,-0.2097819,-0.05747741,-0.2466508,-0.03827237,0.06935385,0.006959472,-0.04594871,0.0391752,-0.1482247,-0.05412438,0.0003703268,0.08056245,-0.05762269,0.01592648,0.09294075,0.1834843,-0.1549408,-0.04476193,0.1363761,0.02991874,-0.03455558],[-0.01129013,-0.001800656,0.02197647,-0.1144769,0.05194302,-0.06711087,-0.05237353,0.01976809,0.06970368,0.07589245,-0.03733425,-0.1979269,0.09931909,-0.03662206,-0.01328298,0.09832566,0.1416889,0.00259328,0.09101542,-0.05393332,0.07421206,-0.0204353,-0.03449346,0.1034335,0.04041397,-0.06018834,-0.06788135,0.07098189,-0.1518388,-0.02463146,0.2151296,0.1332655,-0.1512315,-0.008238243,-0.131103,-0.02524826],[-0.1826298,0.08643908,0.1430732,-0.09963577,-0.04194244,0.08497037,0.005169325,-0.2303844,0.01127663,0.1102028,-0.1742769,-0.09454522,0.04819142,-0.142013,-0.08189622,-0.1084508,0.1251112,0.05298963,-0.02778209,0.04691736,0.009377548,0.08265056,-0.01202522,0.01517291,0.09546661,-0.00277151,-0.0004012114,-0.05896658,0.01127688,0.03736013,-0.09660544,-0.036579,-0.1653477,0.08639939,0.02853162,-0.09019057],[-0.009971384,-0.1553212,-0.07560408,-0.05633987,-0.0956626,-0.07921562,0.01497726,0.05065101,0.1031344,-0.03185617,0.08714483,-0.06410772,0.159613,0.03906788,-0.09313009,0.0612333,-0.04490506,-0.1309206,-0.03637031,0.01322058,0.09081512,-0.08550579,0.05299779,0.002776259,-0.06840833,0.05135766,-0.0718042,-0.0388123,0.04089517,0.07386158,0.1545835,-0.01151286,-0.03982028,0.1255014,-0.02183817,0.1036162],[0.2146342,-0.1010831,-0.2719569,-0.03976317,-0.05448331,0.1280345,-0.2069731,0.01511748,-0.1087927,-0.07443631,0.0706659,-0.1342444,0.1003388,0.04296802,0.05119399,-0.1697058,-0.05672719,-0.08863465,-0.04669087,-0.03883908,-0.1630306,-0.06298225,0.1589464,-0.1824395,-0.1320766,0.09933425,-0.09030747,-0.1102413,0.02913959,-0.07036105,-0.1417141,0.04834357,0.07143284,0.06009607,-0.03057491,-0.1181934],[-0.01009031,-0.03969907,0.01338211,0.0867632,-0.0003309841,-0.123309,0.0732877,0.05848124,-0.02752733,-0.0134198,0.05935188,-0.1227005,-0.03495411,0.01681548,-0.1064245,0.1193353,0.03916973,-0.02949718,-0.03007487,-0.02977255,-0.003181457,0.0371755,0.005908849,0.1277819,0.03023634,-0.06039014,0.009901152,-0.03184411,0.009604304,-0.006030085,0.1374647,0.04358805,-0.1117763,-0.01547735,0.02300164,0.02853882],[0.04124414,-0.02318628,-0.1414229,0.005815765,0.05533345,0.1010114,-0.07793131,-0.02039339,-0.1382962,0.02444669,0.08823372,-0.09686793,0.1104353,0.1004409,0.08657361,-0.1638144,0.02392922,-0.08251382,-0.1653653,-0.0163452,-0.1733559,0.0327562,0.1524935,-0.2335722,-0.1952326,0.05726777,-0.0099434,-0.1031192,-0.04233408,0.004709369,-0.1205685,-0.1186391,0.02704158,0.04597294,0.007226693,-0.07284961],[-0.1520692,-0.1563572,-0.2199211,0.03193336,-0.03174064,-0.02206554,0.009368801,-0.0887261,0.0351563,-0.08842039,-0.09678306,0.05830951,0.0182091,0.06734442,-0.1170197,-0.05854948,-0.01433036,-0.07296671,0.006269847,0.01781871,-0.1137107,-0.1390029,0.01205694,-0.119353,-0.07545963,0.1729069,-0.02728735,-0.07195614,-0.02126289,0.01703816,0.07823841,-0.1459053,0.06681646,-0.03384996,0.002178315,-0.05456696],[-0.1156518,0.03372842,0.006412217,-0.06088908,0.06074655,0.04178318,-0.03662429,-0.008823108,0.03533914,0.02063706,-0.00509326,-0.1300442,0.03881503,-0.02462202,-0.06502944,0.01489497,-0.002683083,-0.0296728,0.02037073,0.0002997611,-0.01460549,0.05911865,0.06156108,0.08866277,-0.06305198,-0.05823756,-0.06574133,0.1014043,0.01990398,-0.01115479,-0.01565642,-0.04722727,-0.1202923,-0.07594748,-0.01262409,-0.05849347],[-0.005483775,0.02828893,0.03609033,0.05928849,-0.1121152,-0.1267117,0.07605125,0.02784582,0.01031226,0.03702377,0.0943373,-0.1246996,-0.05717494,-0.03089443,0.08732074,0.08556806,0.04327158,0.02310774,-0.0327193,-0.07006971,0.07638839,-0.008494758,0.04392631,0.1129711,-0.0006728398,-0.01610096,0.06736845,0.006227562,-0.04121649,-0.08589849,0.1362007,-0.01029707,-0.04016569,-0.04365187,0.02827787,0.07070282],[0.0007168998,0.0513343,0.0308418,-0.08544231,-0.104062,-0.08343488,-0.01379215,-0.0363357,-0.1133811,0.002342001,0.004388701,-0.1133944,0.1111104,-0.004111015,-0.05504991,-0.05682987,-0.003379045,0.01334487,-0.1432935,0.03404656,-0.2386977,0.02522847,0.02616241,-0.02040933,-0.06266563,-0.01281793,0.01264591,-0.03501622,-0.01490895,0.09696171,-0.1352353,-0.05890375,-0.06312306,-0.00405875,0.01408646,-0.02106763],[-0.01996775,-0.05944926,-0.09116302,0.02243081,0.0446452,0.1664463,-0.01124775,-0.0754216,-0.01457896,0.07423428,-0.03824636,0.002646843,0.04893228,-0.03584422,-0.09495401,-0.08412273,0.1803516,0.05822818,0.03774548,0.1077652,0.009619041,-0.1282043,0.04215257,0.007607687,0.08648405,-0.1259865,0.01069724,0.0880013,0.04298903,0.01243865,-0.02679943,0.02938314,-0.1419371,-0.02577106,-0.05088113,-0.03439131]],[[0.1258619,-0.2250658,-0.05372947,0.08524862,0.04171591,-0.1860961,0.2483572,-0.06442755,-0.08328689,0.04004951,0.199776,0.1442671,-0.002431425,-0.09960035,-0.04939439,0.07441175,-0.03460539,-0.1757575,-0.2307977,-0.03168857,-0.1261201,0.1125629,0.07657361,0.06039489,0.02543351,0.1257226,0.07263586,-0.3425908,-0.1734108,-0.05960617,-0.1241002,-0.09650151,0.2011191,-0.03211433,0.1080432,-0.03286704],[0.06170306,0.005712381,0.1184939,0.03810363,0.03015219,-0.01794101,-0.07480902,-0.08884853,0.05360153,0.03675906,0.06494149,-0.0798729,-0.06583812,-0.005083569,-0.04041488,0.02144725,-0.1015719,0.03983731,0.05022164,-0.06071783,-0.02459273,-0.02341747,0.04122175,0.02636497,-0.02274556,-0.1115047,-0.005841068,0.07799041,0.03292454,0.04831901,-0.003233594,-0.01435873,-0.08980259,-0.02252826,-0.001855877,-0.07779422],[0.1194103,0.137177,0.03983659,-0.006211801,0.02760834,0.04157741,-0.09340183,0.08354308,0.1657125,0.1798133,0.04703872,-0.03538616,-0.08376985,-0.0929108,0.06484296,-0.05881571,0.1777621,0.01968493,0.1183373,-0.02369528,0.107781,0.04269084,-0.05989038,0.05611549,0.1739335,-0.1119226,0.005961937,0.08307839,0.08249116,-0.04411469,0.167468,-0.03942664,-0.284609,-0.06458493,0.04811555,0.01863201],[-0.06773098,0.0072284,0.142758,-0.09339154,-0.04675199,0.003598388,0.02511104,-0.02333851,-0.0826595,0.02841763,-0.03765075,-0.07693052,-0.005375817,-0.05121283,-0.03069097,-0.09866811,0.1125702,-0.03096835,0.05216999,-0.1088641,0.07376605,0.158982,-0.001372796,-0.04166675,0.127233,-0.1025879,-0.00939474,0.03233209,0.01759751,-0.06056954,0.03058345,-0.1315373,-0.03564657,0.009528776,0.09810087,-0.05003976],[-0.07120032,0.05215453,0.05810207,-0.05100086,0.01573828,0.03303483,-0.1811095,-0.0230434,-0.002821398,0.03227665,-0.05480168,-0.1579899,0.151195,-0.06167264,-0.07573831,-0.02004263,-0.1684056,-0.261006,0.03612591,0.06434737,-0.04193878,0.005199071,-0.01225809,-0.08932915,0.04541424,-0.04452309,0.1448064,0.07819045,0.08980183,0.1246562,-0.1252163,-0.09581216,-0.07925831,0.2044999,0.01670597,0.03471677],[0.06689401,0.09340488,0.03410169,-0.04563931,-0.03696268,0.01068154,0.0179265,-0.1605708,-0.03739813,0.02602858,-0.05213979,-0.1737848,0.1326773,0.008301596,-0.04318863,-0.04737595,0.1188926,0.07232463,-0.04057125,-0.03817919,-0.05260503,0.06869987,0.08206599,0.1591725,-0.06041541,-0.06139819,-0.09489112,0.1124656,-0.09396967,0.07151696,-0.01074029,0.04862669,-0.1065457,-0.0424855,-0.02157958,0.01597554],[-0.09083515,-0.03319919,-0.05827773,-0.03121912,-0.0393324,0.04107304,-0.03996191,0.003337589,0.1160401,0.02951038,-0.04774639,-0.09289251,0.02824775,-0.02179663,-0.1306932,-0.122662,-0.06403928,-0.01669036,0.1377684,0.04263485,0.06778144,-0.07075655,0.05902748,-0.06007981,0.03809253,-0.02075921,0.05523619,-0.0400096,-0.009950968,0.01811816,0.06893925,0.002885143,-0.03161125,0.05903869,-0.03256575,-0.08427872],[-0.07764062,0.1012022,-0.00440674,0.006981123,-0.06855034,0.005504958,-0.005822769,-0.1234951,0.05347091,0.1239593,0.1094097,-0.07406706,0.1329035,0.01958472,-0.2284934,-0.06871268,-0.005299383,-0.198862,-0.003156364,0.04307383,-0.1251808,-0.07838158,0.1001543,0.110708,-0.04231988,0.01913363,-0.01612241,0.07026243,-0.1314331,0.1362814,0.07768823,-0.0673788,-0.05227487,0.0262988,0.03479801,0.04142737],[0.1749275,-0.02060024,-0.1271599,-0.058727,-0.121559,0.09255581,-0.07304004,0.07189212,-0.0261621,-0.05447345,-0.08047608,-0.1648314,0.09266064,0.1112382,0.08472609,-0.1708923,-0.2563995,0.03379354,-0.08876129,-0.1100617,-0.1321609,-0.1295318,0.01709994,-0.08634853,-0.1340464,0.06766519,0.03584613,-0.1022886,-0.1357545,0.0504088,-0.06948684,0.05813402,0.1504069,0.08549798,-0.04100002,-0.05014202],[-0.06360773,0.1019284,0.01462583,0.05768635,0.05096161,0.007995269,0.05466702,-0.08037134,0.01365873,-0.02348121,-0.01397788,-0.06573636,0.006439453,-0.03056243,-0.08094924,-0.03384962,0.09210602,-0.05500954,-0.01557531,0.005438828,0.0178089,0.007945247,0.0299979,0.1272652,-0.008065814,0.004553076,-0.0004949079,-0.004329113,-0.1030978,0.06192612,-0.003131365,-0.01781789,-0.1325835,0.04297214,0.0007056753,0.0716868],[0.03698772,-0.1368433,0.02737739,-0.0422296,-0.06336907,-0.02034507,0.02619743,0.08589254,-0.06024319,-0.0003762248,-0.01666371,-0.08017189,0.07790069,0.1624763,0.04524953,-0.08227027,-0.1642791,0.07809511,-0.1316503,-0.08943183,-0.2106609,0.09582992,0.003485702,-0.09587257,0.02687834,-0.002915519,-0.006637108,-0.08852449,-0.0388918,0.03258434,-0.07113606,0.003636245,0.1048601,0.06146283,-0.04060937,-0.1559623],[-0.04458963,-0.04612423,-0.09996359,0.04165933,0.007243168,-0.01275739,-0.06178515,-0.2471179,-0.02811068,0.0007024613,-0.08754714,0.09642453,-0.005941418,-0.1134606,-0.286906,-0.07043936,-0.07835208,-0.2037819,-0.0917615,0.02197429,-0.2116178,-0.053779,0.03855086,-0.05910104,0.002689986,0.1503794,-0.01695743,-0.1178047,-0.1229237,0.04821656,0.04155729,-0.0777842,-0.01525657,-0.001164733,-0.06269269,-0.04266069],[-0.08404841,0.03127944,0.01519099,0.02157873,-0.06069391,0.04996518,-0.05174055,0.009078936,-0.05144861,-0.03421864,-0.007843526,-0.07090698,0.05159756,-0.01423139,-0.04142551,-0.05864252,-0.08527698,0.02477499,0.09449344,-0.008432376,-0.01845958,-0.02852649,-0.002006837,-0.02253777,0.04305105,-0.1317053,-0.02494095,0.04953627,-0.05388963,0.03102744,-0.00401363,-0.009410847,-0.1660419,-0.05781536,-0.06113103,0.03510702],[-0.04756894,0.0887501,-0.0629117,-0.01674316,-0.05288586,0.05404187,-0.03909508,-0.1168094,-0.03441899,-0.04206791,0.05624028,-0.03876144,-0.0426241,-0.04802359,7.798479E-05,-0.07058766,0.02526222,0.06655173,0.07544363,-0.0723428,0.1064803,-0.02581326,0.1046988,0.05006185,0.03566258,-0.0219775,0.002130611,0.04062848,-0.03896491,0.03210433,0.02462413,-0.08075324,0.02041511,0.00348983,-0.02544133,-0.0387759],[0.01509313,-0.07267635,0.01826507,-0.1181718,-0.06565233,-0.1667453,0.006367755,0.02989954,-0.02424506,0.0005746468,-0.1834682,-0.08250405,-0.01726865,0.07483658,-0.05346707,-0.1607834,-0.1276875,0.08214613,-0.02751089,-0.02999481,-0.02740789,-0.005334957,-0.001985078,-0.1561582,-0.01887306,0.03331716,0.01739941,-0.07866314,-0.1552501,0.08570426,-0.1221164,-0.1243952,0.1187236,0.01380346,-0.05006947,-0.1192793],[0.07229149,-0.004196569,-0.08456177,0.05558399,-0.04087757,0.02745758,-0.1344847,-0.005882879,0.1047022,0.06104877,0.0446554,0.06716616,-0.1103522,0.05191403,0.131452,-0.1331945,0.05213063,0.1009973,0.1125111,-0.04708439,-0.02589713,0.008686253,-0.08843599,0.04579204,0.05885661,-0.1801915,-0.1055482,0.09785298,0.001189487,0.003691341,0.03740369,0.09949267,-0.148239,-0.1263326,0.02532881,-0.2006755]],[[-0.09228539,0.1183078,0.04950917,-0.1322109,-0.1689652,-0.2471184,0.05493457,-0.08324996,-0.0253777,0.01073141,0.00225962,0.05770706,-0.1974035,0.001761412,-0.05943413,-0.02719423,-0.1656427,-0.0174758,-0.1830671,-0.1433719,-0.06919686,0.01165605,0.1169302,0.2348103,0.114499,0.1094724,0.04142327,-0.1276751,-0.241542,-0.1862876,0.03166209,-0.07963939,0.1843748,-0.012609,0.09824911,-0.1151062],[-0.01498334,-0.02333095,0.0670443,0.05970876,0.02973196,-0.06691182,-0.06642622,0.05738474,0.04102541,-0.1368178,-0.04855457,-0.06619793,0.01588555,-0.01066417,0.0234257,0.006268513,-0.01170116,0.06119845,0.006457824,-0.007424141,-0.05923736,-0.07483383,0.0252545,-0.111723,-0.0206192,-0.07231169,-0.001442689,0.0223543,0.03010012,0.03084982,0.01669911,-0.04505224,-0.02658343,0.07835852,0.00270023,-0.02800738],[-0.03916324,-0.04035124,0.07649619,0.01656187,-0.1001335,0.1426543,0.02959258,0.005525654,0.009096467,0.003124902,0.2406695,0.09388869,-0.01896863,0.02292766,0.08402955,0.05203496,0.1723821,0.01171169,-0.07857161,0.01777928,0.1281411,0.1941257,0.02600426,-0.1125487,0.06081875,0.03026573,0.02006513,0.1544987,0.1635978,-0.05372956,0.02559449,0.04907091,-0.07756998,-0.02366195,0.1359933,0.1263373],[-0.1553541,0.0065277,-0.0159348,-0.1509786,-0.07386851,0.08097351,-0.1392111,-0.02415918,0.04034264,-0.01428475,-0.06204071,-0.1049312,-0.1601371,0.008834016,0.003721043,-0.1385643,-0.0529299,0.005722,0.01076521,-0.1205852,0.03249186,-0.0176128,-0.007012579,-0.02285976,0.03009213,-0.04508671,0.07305243,0.01549588,0.05100045,-0.1088939,-0.004684838,-0.07446507,0.06541491,-0.1562901,0.06188697,-0.005050023],[-0.07205447,-0.0240865,-0.04947912,-0.07137658,-0.1176725,-0.05727642,-0.03289682,-0.03144374,0.166838,0.06537597,-0.09436468,-0.1517308,0.004629601,0.08434933,0.03682188,0.04785392,-0.07682604,0.08081631,0.1016127,-0.01128435,0.1428254,-0.03022726,0.06038993,-0.07359574,-0.009723429,-0.3324857,0.05848223,0.1306468,0.03175534,0.1101291,-0.01191778,-0.1065636,0.04018931,0.09653594,0.01555346,0.01691581],[0.08707217,0.07051469,0.05108427,-0.02102805,-0.07494482,0.04749384,0.1252555,0.1366259,-0.04763581,-0.0208312,-0.0835791,-0.08851112,0.03598408,-0.005853046,0.1057116,-0.03075486,-0.02435099,0.1747562,-0.1079755,-0.01939232,0.01554581,0.03072977,0.05988773,0.02180611,-0.08279265,-0.04705062,-0.01509732,0.01291391,-0.029295,0.03656813,0.03446569,0.1266843,-0.09899759,-0.01671106,-0.06598485,-0.1396733],[-0.06169741,-0.08153574,0.06205754,0.07603352,0.0296348,-0.0016501,-0.04409586,0.04018648,0.04632919,-0.03137191,0.0221569,-0.01755359,-0.1272854,-0.1295552,-0.07448932,-0.1238714,0.0522384,0.0136872,0.01180343,-0.01484222,0.08017422,-0.05675677,0.08813621,-0.009159494,0.08866794,-0.04889881,-0.03407139,-0.07582261,0.05810625,-0.08716062,0.02001745,-0.000817202,-0.0291384,-0.1238701,0.02470146,0.07515708],[0.01062384,0.1843022,0.05010246,0.003863294,-0.009693088,0.01782092,-0.1055803,-0.0003317479,0.04831305,0.0963902,-0.01844477,-0.0168164,0.04765063,0.07605187,-0.04521844,0.03880062,-0.1241111,0.01980533,-0.04093244,-0.04363656,-0.04526714,-0.04325848,-0.02340637,0.05040421,-0.0413053,-0.01192114,0.0525649,0.0791538,-0.04130402,0.1066804,-0.1306874,-0.00317562,-0.1152767,0.03788819,-0.001595438,-0.09556258],[0.1573435,-0.1461977,-0.1435974,-0.05760501,-0.1659623,-0.04307018,0.03290258,0.008902017,-0.05407338,-0.02166088,-0.02282335,-0.1627362,-0.1083992,0.05946721,0.04072383,-0.1141921,-0.1644042,0.1084728,-0.110792,-0.08355036,-0.1014977,-0.08253718,-0.010896,-0.03430154,-0.103547,-0.0199183,0.03066119,-0.131773,-0.1469087,-0.1113957,-0.09011485,0.03897988,0.1372236,0.0329551,-0.1299501,0.01729357],[0.01133496,0.1109294,0.0443744,-0.03932956,-0.004910256,0.07213913,-0.07253756,0.07829861,0.03066906,-0.05721161,0.03259747,-0.04894331,0.02726915,0.08563252,-0.06038749,0.05868764,-0.1146463,-0.009192927,-0.05561461,0.03951918,-0.00293532,-0.06804273,-0.0155278,0.001539257,0.03389087,0.04146806,0.05107121,0.002539286,-0.01517291,0.005953511,-0.05042363,-0.01389983,-0.0920077,0.06340832,-0.002312575,-0.09634671],[0.08978547,-0.1925725,0.01302689,-0.1033913,-0.04989122,-0.09124476,0.102154,0.07258185,0.02712187,-0.0002279462,-0.2044716,-0.2364497,-0.03352481,-0.04935536,-0.03560448,-0.2315334,-0.09917196,0.0647505,-0.04843575,-0.2334092,-0.002689629,-0.09593822,0.03861163,0.02481483,-0.03006953,0.04735491,0.06569381,-0.07676377,-0.07711161,-0.1272011,-0.006727929,-0.02978037,0.07262491,-0.04915283,-0.03895627,0.05244754],[-0.006619724,0.07742451,0.06150836,0.07805149,-0.09506622,-0.04451807,-0.1980457,-0.08211125,-0.07297582,0.1354505,-0.01533254,0.005546786,0.02526738,0.01212224,-0.1000047,0.1881803,-0.1232582,-0.02374008,-0.0922555,0.05100609,-0.2827089,-0.05325776,0.1039355,0.04837129,0.06563773,0.09310862,-0.005818022,0.05349392,-0.08238655,0.142666,-0.104469,-0.04514449,-0.09289635,0.07204088,0.008378682,0.06218122],[-0.06889819,0.01359787,0.01985841,-0.03250885,0.07102541,-0.01276903,-0.1432781,0.02308122,-0.0180423,-0.1527319,0.00167537,-0.06711964,-0.03055204,-0.01437035,0.05881304,-0.06209075,-0.1087329,0.03664466,0.02864235,0.05746249,-0.06356887,-0.138357,0.0480738,-0.03261136,0.01666146,-0.09040834,-0.06688347,-0.004278939,-0.08686295,0.05231574,-0.0907344,-0.002250866,-0.1321052,0.04421262,0.04249173,-0.02280532],[-0.04929842,0.1126197,0.03228391,0.01355554,0.08353215,0.05519186,-0.1062065,0.1626383,-0.1119309,-0.113511,-0.04408126,-0.01617547,0.04011859,0.008282473,0.1099565,0.01738232,-0.1800418,0.01838315,-0.06859083,0.005398311,0.02012117,-0.007912748,0.03368044,-0.04463267,0.008866654,0.03662689,-0.03941812,-0.01630328,-0.001388472,0.06098556,-0.03215487,-0.05727425,-0.06422922,-0.0792983,-0.01130391,-0.08253781],[-0.08707163,0.08705246,-0.1227839,-0.1168891,0.07592776,0.045798,0.03943434,-0.05871028,0.1104743,0.03054683,-0.1697502,-0.0400913,-0.06524032,-0.1385663,-0.1068399,-0.1770799,-0.1661007,-0.06241606,-0.02805332,0.0246754,0.08864597,-0.07830721,0.0681956,0.02271399,0.07997665,-0.06120741,0.06599903,-0.08643944,0.01434404,-0.07375176,-0.07838792,-0.1686502,0.08028457,-0.06389149,0.02388561,-0.08669878],[0.03457236,-0.1997103,0.001965928,0.04431334,-0.0757983,0.06893996,-0.03854669,0.04380627,-0.06039584,0.0286421,0.1274015,0.1087202,-0.02864111,-0.05893137,0.01360929,0.07176779,0.04252586,0.02229257,-0.04866093,0.01245163,-0.02079703,0.02320992,0.006947847,0.03325949,0.01944187,0.0791641,-0.03394713,0.006751487,0.02178721,0.04179226,-0.03030285,0.1209763,-0.1594246,-0.006806772,-0.06259909,0.02667546]],[[-0.2212002,0.2053816,-0.1870857,-0.1604746,0.02890527,0.02532857,-0.09573708,-0.07442886,-0.0617028,0.07567913,-0.02236511,-0.04015544,-0.07950991,-0.02315686,-0.1034159,-0.03741191,-0.2180332,-0.04651644,-0.1567525,-0.06380704,0.06490681,0.1005243,0.1949627,0.2118015,0.05307436,0.07483091,-0.01610333,-0.0975455,0.04543635,-0.04964012,0.02692424,-0.1747936,0.1313952,-0.08259803,0.1915796,-0.02757864],[0.010077,-0.06272586,-0.003237778,0.02252785,-0.01886741,-0.02832373,0.05151809,0.05535646,0.05619917,-0.1664579,-0.08904763,-0.03695484,0.0238945,0.02459054,0.06647712,0.02018921,-0.01952585,0.05381846,0.13956,0.03982458,0.03021017,-0.04478483,-0.001993775,-0.1016975,-0.04208884,-0.02210972,0.05199936,0.0632787,-0.006962624,0.03888634,-0.03240812,0.05705233,-0.07553832,0.03452272,-0.01636194,0.09621475],[-0.1486486,-0.04332747,0.114587,0.044514,-0.08652966,0.02320159,0.2416383,0.008019385,-0.07833271,-0.1408277,0.2127333,-0.04473853,0.04706362,-0.03132946,0.1482258,0.06884644,0.06390179,0.02501376,0.002781427,-0.03062854,0.02007233,0.2516044,-0.1913587,-0.224946,0.1051238,0.1918858,-0.1105709,0.1552407,0.03148376,-0.1108795,0.2420322,0.1254321,0.01108364,0.07290514,0.06455702,0.02336526],[-0.1760478,-0.0632877,0.000793005,-0.1288343,0.1170283,-0.06859795,-0.0933839,-0.05316041,0.03701833,-0.07023872,0.002369058,0.05621729,-0.05117265,-0.001824817,0.001147505,-0.1965824,-0.002338286,-0.01358394,-0.07247439,-0.05731729,0.08420677,-0.07728192,0.03940092,-0.1481391,0.05219835,-0.07093014,0.03340278,-0.0742536,0.1516377,0.01475345,-0.06908553,-0.05365719,0.03358918,-0.1965221,0.04037228,0.06844207],[0.02661359,0.006247316,0.07753696,0.02285355,0.03815448,0.02702003,-0.03188417,0.1122032,0.1187703,0.04465917,0.1006182,-0.2126859,-0.0699141,0.006270326,0.05413019,0.1294212,-0.2217689,0.02915408,0.1693744,0.005692946,0.008583673,-0.05993685,0.1766687,-0.03292072,0.03922414,-0.1476415,-0.05325355,-0.01154862,0.07282262,-0.03082691,0.03994682,-0.1052933,-0.1919468,0.1237756,0.02326208,0.02634857],[0.1007396,-0.2352525,0.02951911,-0.0008570398,0.07850228,-0.01796689,0.05395856,0.02097163,-0.03692783,-0.1017293,0.07973994,0.08918834,0.04861638,0.009340109,0.03628619,-0.03013843,0.04876369,0.04036298,0.05163101,0.05211395,0.1748084,-0.1581006,-0.003653914,0.0173492,0.0267712,-0.07085753,-0.05038454,0.1260766,-0.002814608,0.002607701,-0.00626701,0.1228091,0.006351283,-0.006916468,-0.019943,0.02612826],[-0.1248594,-0.04445934,-0.02261978,-0.03941903,0.04622179,-0.03859288,0.1406002,-0.01822751,0.06095116,0.03377954,0.02965443,0.07294974,-0.05593566,-0.02398238,-0.07836369,-0.00104212,0.09132414,0.01744157,-0.02658293,0.01762545,-0.1196561,0.006681681,0.02120849,-0.05793075,0.08005467,0.009383314,-0.05417593,0.09586845,0.02744786,0.02976357,-0.0397913,0.04811529,-0.1538698,0.05341281,0.1116566,0.1014639],[0.1417348,0.01096192,0.0312735,0.06885886,0.0678508,0.06190898,-0.09414677,0.08748173,0.03891586,0.01133551,0.01110935,-0.06808182,0.06937571,0.0104789,-0.06735209,0.1457029,-0.04108487,-0.002766159,-0.0411781,0.03784081,0.121837,-0.08732068,0.03258913,-0.005470476,0.0005705574,-0.02293503,-0.02836281,0.06673355,-0.07939485,0.09546748,-0.1010585,-0.07628968,-0.1454931,0.04393217,0.03200733,0.004377389],[-0.06134678,0.05640392,-0.1686219,-0.1367173,-0.1516083,-0.1403119,0.08614185,-0.09222357,0.008829049,0.0370011,-0.1906875,-0.210043,-0.1323245,0.1572091,-0.05868224,-0.308496,0.03836834,-0.0795602,-0.143295,-0.1497477,-0.08522253,-0.04443448,0.08472728,0.0675894,-0.006642047,0.05296235,0.0368157,-0.1173283,-0.02404974,-0.08791155,-0.04560554,0.04390572,0.01813163,-0.06847885,-0.03281499,-0.1244729],[0.07178768,0.01706093,0.04570922,0.07880342,0.06062536,-0.04889693,-0.09557735,0.1520035,-0.0007362883,-0.06236679,0.04018576,-0.07543,-0.04598618,0.05798567,-0.04085835,0.05220624,0.007482081,0.01194819,0.0994001,-0.03643424,0.02636437,-0.06736352,0.03685945,-0.07589462,-0.02227794,0.03201347,-0.01284814,0.09597228,0.03460355,-0.07004473,-0.06238387,0.05239301,-0.09230746,0.0450687,-0.0223181,0.04363088],[-0.10199,0.09567507,-0.2336102,-0.1945431,0.03397549,-0.04525011,-0.008077578,-0.1443708,0.0550824,-0.03059085,-0.1773157,-0.1633936,-0.1804493,-0.03126884,0.01186007,-0.293496,-0.05614122,-0.1158666,-0.0404936,-0.2508563,-0.06706558,-0.07751628,0.07988262,-0.002750856,-0.0190374,-0.01007949,-0.03307452,-0.1286835,-0.02277653,-0.1148183,-0.09120696,-0.1258338,0.03235421,-0.06562353,0.03127425,-0.1371875],[0.09976318,0.05738471,0.06339753,-0.01977308,0.01546159,0.01227782,-0.06087639,0.003453472,0.01768753,0.07429374,-0.0003780261,-0.117415,0.08685003,0.03670581,-0.08250439,0.1991258,-0.09280697,0.04865886,0.05523065,0.06297677,-0.1271508,0.059327,0.07879788,-0.04985125,0.08758476,-0.1066282,-0.0922364,0.08521122,-0.08096892,0.1100287,-0.08108998,-0.02789247,-0.08979774,0.1336725,0.06914081,0.08094715],[0.03124242,-0.0695385,-0.05438638,0.07094218,0.04108255,-0.06578725,-0.009605255,0.05314207,0.1079986,-0.02960465,0.02019776,-0.04939705,-0.03451816,-0.006114772,-0.007150553,-0.1243618,-0.02103905,0.02869365,0.0636876,-0.06061657,0.07243052,0.02290858,-0.02279025,-0.1734063,-0.03021204,-0.06524719,-0.03950786,-0.06553765,0.1023105,-0.09116073,-0.02577705,0.05369759,-0.09801555,0.059664,0.001168227,-0.001357403],[0.07880805,-0.1372981,-0.07123695,-0.0323017,0.04859122,0.03344608,0.006224757,0.05286076,-0.001687419,-0.05975034,0.02239017,0.05272894,-0.05524635,-0.03612836,-0.03050843,-0.1333382,0.01594727,0.04498765,-0.04622831,0.07664135,0.03347335,0.04374746,-0.02675059,0.00754957,0.02919795,-0.05716656,0.009933953,0.0517129,0.04886856,0.0122853,-0.02643906,-0.03647372,-0.0463196,-0.04257019,-0.01994153,-0.004319306],[-0.2105591,0.1496327,-0.04764058,-0.1102285,0.09580629,0.08736607,0.08134425,-0.05276431,0.03897856,0.08467111,-0.1090402,-0.1284218,-0.02638011,0.001637954,0.09643281,-0.1143311,-0.1159855,-0.1299449,-0.06942893,-0.1249171,-0.1181258,-0.02257847,0.02556169,-0.07990764,-0.01929817,-0.2251742,0.03706326,-0.1443344,0.1436076,-0.2025792,-0.0005542564,-0.1148648,-0.05210249,-0.06116303,0.005682221,-0.1492621],[-0.008397128,-0.1773774,0.07359065,0.07305027,-0.03744816,-0.1242094,0.1700227,0.0376571,-0.1140477,-0.1581382,0.09609498,0.07382242,-0.06521275,-0.09586234,-0.0219407,0.06151335,0.1416776,0.03931646,0.01197848,-0.05820922,-0.08368005,0.08466113,-0.109563,-0.1502578,-0.09159132,0.1000523,-0.06803548,0.07766958,-0.1363865,-0.111386,0.06447391,0.07523607,-0.05910367,0.05883486,0.02512268,0.05430625]]],[[[0.07748146,-0.0779458,-0.09841104,-0.0179787,0.0983842,-0.00881756,-0.1577447,-0.01310919,-0.0954591,0.02508963,0.1718465,0.1436753,-0.1442154,-0.0757418,-0.1380922,-0.1376538,-0.1308578,-0.1355079,-0.2489461,-0.02839498,-0.1238284,0.03506589,0.2461455,-0.2658476,-0.0003248708,-0.07401433,0.01162677,-0.1842506,0.08323634,-0.009643367,-0.04410015,-0.02807574,0.08995562,-0.04201425,0.03785808,-0.1899223],[0.03808229,0.0345238,0.07313562,0.07373368,0.02847872,-0.134242,0.07305485,-0.08169404,0.03888674,0.05232589,0.09656093,0.05007111,-0.1108821,0.03587158,-0.03935902,0.01443486,0.01614692,0.07592673,0.004306801,-0.07924182,-0.04426762,0.0760522,-0.04850972,0.05278682,-0.1028098,0.06234067,0.04125024,0.0256048,0.08366638,0.01357362,0.02317762,0.0756703,-0.04976127,-0.1066209,0.000702258,0.01003158],[0.08201161,-0.142752,-0.1258209,-0.1130444,0.02849029,-0.04952876,0.05439523,0.03081549,-0.05156794,0.01201529,0.1012059,0.03689319,-0.2190659,-0.03970567,0.1113041,0.1150834,0.2557653,0.1174488,-0.07251287,-0.1461268,-0.07467149,-0.04452938,-0.2446918,-0.1177831,0.08967106,0.03362638,-0.02552542,-0.1347761,0.1545116,0.08689424,-0.04436803,0.1573611,0.003626675,0.01221181,-0.173953,0.00643094],[-0.1184819,0.1156412,-0.01010504,-0.02507213,-0.03668938,0.02342774,-0.04499649,0.08781917,0.0869646,0.0792698,-0.07208091,0.01503274,-0.1598837,0.06738105,0.05489724,-0.02383388,0.08726005,-0.1009921,-0.06002368,0.007454521,-0.1344888,0.0203976,-0.01329063,0.1096706,0.02136517,-0.03889356,0.01453965,-0.009472341,0.08784771,0.05275333,-0.1143441,0.06410465,-0.1830681,-0.03537962,0.05093981,-0.01036399],[0.1669768,0.04159473,-0.07094036,0.1634287,-0.1093901,-0.009048396,0.09689968,0.01921665,0.06872325,0.04501241,-0.04382079,0.1332755,-0.1931767,0.04550343,-0.02843332,0.1097229,-0.08624841,0.03173715,-0.1207565,0.1405697,-0.03894564,-0.009047361,0.04794023,-0.0402221,-0.07536345,0.02667692,0.03306285,-0.1365565,0.06807145,0.01281526,-0.04656002,0.01574891,-0.02017447,0.1120667,0.1086817,-0.01848374],[0.02745606,0.01283199,0.07655331,-0.0362689,0.01580532,0.04443621,-0.01278103,0.119905,0.05611384,-0.03743932,-0.06809485,-0.06784716,-0.02511062,0.1425113,0.09885881,0.1217804,0.002403409,0.08928653,0.04218718,0.0121811,-0.01117477,0.02897896,-0.0998181,0.1095399,-0.003734498,-0.06845599,-0.09604881,0.04137837,0.03682907,-0.05716265,-0.03104962,0.1149689,-0.060389,-0.00633542,0.02790018,-0.04737489],[-0.02456779,0.06684197,0.03502508,-0.1102381,-0.05281053,-0.03456839,0.133935,-0.313309,0.09133385,0.1032708,0.05868903,0.1017997,0.03913498,0.05374521,0.01283828,-0.08372138,0.09975492,0.07641263,0.06869754,0.04584315,-0.02331095,0.0510316,-0.1198549,0.06351136,0.05608926,-0.06597985,0.04828591,0.03551785,0.003002322,0.1166782,0.02477955,0.05029142,0.04896401,0.06484972,-0.05131579,0.002089603],[0.2200183,-0.01677926,0.1190307,0.09006212,-0.1196118,-0.05262559,0.06532291,0.02856302,0.01340322,-0.1365721,0.05844578,-0.009316425,0.07146069,0.1563912,0.1344555,0.02474272,-0.04745198,0.1098987,0.0298324,-0.04713771,-0.004521721,0.1032178,-0.01929455,-0.07094938,-0.06134005,-0.02778553,0.1040343,-0.1013554,-0.04816138,-0.06338388,0.06215677,0.1016081,0.07503457,-0.03096958,0.06502394,-0.1672481],[-0.09686584,-0.04415824,0.0345367,-0.05045602,0.02226613,-0.01977209,-0.2120733,-0.06513958,0.005137302,-0.09117239,-0.02319298,-0.05685625,-0.04182987,-0.04599907,-0.02963499,0.1342345,0.04646315,-0.03716241,-0.09643876,-0.01704897,-0.00469256,-0.1831342,0.09664403,0.02534992,-0.04650851,0.0331439,-0.04456915,0.09709218,-0.007231325,0.02725738,0.1371294,-0.0356257,-0.1504237,-0.01210385,0.09913316,0.01601649],[0.008842397,-0.02782283,0.06610937,0.07712281,0.00795971,-0.04495807,0.08406864,-0.02842225,-0.04827937,0.06725288,0.1025704,-0.04726275,-0.001649696,0.04580612,0.04557569,-0.03932341,-0.01454791,0.06178884,0.08451853,0.01740834,0.0120328,0.1148978,-0.1227026,-0.009792555,-0.01588389,0.06295668,0.08288906,-0.00463339,0.0201649,-0.09319216,-0.001583155,0.1392067,0.01402984,0.02100511,0.06391001,-0.09608826],[-0.09325026,-0.1061553,-0.05093761,0.02223113,-0.004984265,0.03243544,-0.2086063,0.07082611,-0.05185083,0.0155754,-0.05180117,0.01672609,-0.1286812,-0.02686515,-0.0551617,-0.01596752,0.01598745,-0.05540307,-0.1278755,-0.0303208,0.1244526,0.04566621,0.0782767,0.0364291,-0.1480073,-0.00984489,-0.04601334,0.08200569,0.129469,0.08703197,0.07425453,-0.01376522,-0.2142861,0.01171702,0.1357194,0.05624297],[0.1037731,0.04236631,-0.0854908,0.04432812,0.05287743,-0.04131455,-0.05804608,-0.325631,-0.0549042,-0.1072747,-0.02488644,0.1611728,-0.03751363,0.11456,-0.0746282,-0.1156825,-0.1274087,-0.03497529,-0.1457429,0.01879484,-0.01829436,0.02055531,-0.007657657,-0.1481296,-0.1524494,0.01499909,0.0299825,-0.184827,-0.004567024,0.002636177,-0.1263689,-0.09665906,0.1253879,-0.08083639,0.02313197,-0.07853181],[-0.03095658,-0.03618506,0.1059867,0.0540753,-0.07139492,-0.1098801,0.003585319,0.02964989,-0.01793599,0.03875316,-0.006751588,-0.03272162,-0.1008547,0.05026322,0.04142376,-0.07350535,0.04289124,0.02412851,0.0079939,-0.05833075,0.02861663,0.08332512,-0.07340582,0.07366901,-0.06468591,0.02940089,0.08958685,-0.02710522,-0.0476011,-0.05046609,-0.05676337,0.03260081,-0.04863195,-0.06998942,-0.001609281,0.0401596],[0.04989186,-0.01128563,0.03904045,-0.09010248,-0.1255128,0.07823276,0.006365395,-0.08564653,-0.03861682,-0.03882944,-0.01286838,-0.03980722,-0.03688351,0.1361397,0.03167582,0.03074086,0.03686375,0.02752504,0.08410325,-0.03706842,-0.1371223,0.07119381,-0.06859561,-0.002843402,0.0614672,-0.006795402,0.03365248,-0.0242762,-0.04661497,0.008926452,-0.08612321,0.06040492,-0.1015827,0.07763463,-0.04541917,-0.04624482],[0.02833523,0.02324589,-0.006166158,0.116213,0.02786499,0.03891933,-0.01891473,0.05666016,0.002003148,0.01423812,-0.1865178,0.08760796,-0.004592572,0.0508891,-0.01867444,-0.03801274,-0.07745261,-0.04122007,-0.1572838,0.02100742,0.07690659,-0.05264778,0.04492094,-0.04284275,-0.08312842,-0.06726139,-0.02639712,-0.06116117,0.06593151,-0.0700088,-0.0287601,0.001876283,-0.1073713,-0.05055024,0.1133309,0.08615576],[0.01622666,-0.1213797,-0.07697742,-0.102416,0.07109933,-0.07655784,0.05580116,-0.2146075,-0.1472193,0.01375344,0.0727574,0.05064383,-0.04334269,0.06036571,-0.05796379,0.1818756,0.2126466,0.1316639,0.01657338,-0.08090318,0.06421207,-0.08818205,-0.1388262,0.06262853,0.1023255,0.0452665,0.04162318,-0.006854593,0.1313818,0.003059739,-0.05692928,0.0580912,-0.07709236,-0.07872393,-0.1417222,0.06819078]],[[0.0747072,-0.07271561,-0.1709601,-0.2039241,-0.1113828,-0.1713837,-0.04632181,0.006736877,-0.227715,0.0348531,0.132396,-0.00360783,0.0215795,0.03169137,-0.1288825,-0.05793154,-0.1295777,-0.2403044,-0.1951036,0.02867861,-0.1688235,0.2165962,0.1233116,-0.3312926,0.06630313,0.08087227,0.1486543,-0.2450612,-0.1336993,0.08793701,-0.1472091,-0.07621817,0.01764428,-0.0119614,-0.04065329,-0.08303691],[-0.02808132,-0.02377727,0.04906559,0.09200721,0.02845734,0.04356374,0.009627312,-0.07830485,0.03765135,-0.08641607,-0.01280208,-0.01169949,-0.1329113,-0.1365362,-0.07668303,-0.008411146,-0.05934589,0.04875488,0.01350985,0.05981506,0.09037295,0.0440065,-0.08269207,0.07983434,0.007570087,0.007984022,0.01908761,0.001849355,0.02581954,-0.01684318,0.03952298,-0.06515753,-0.107361,-0.01805346,-0.04701954,-0.05912822],[0.003354019,-0.06730544,-0.05762611,0.03312056,0.03928877,0.08362485,0.0401224,-0.04493731,0.01284246,0.05711967,-0.0541262,0.0530473,-0.1794733,-0.02222351,0.08519294,-0.05365716,0.03246227,0.01367421,-0.07585521,-0.1035287,-0.1075532,-0.09926722,-0.270157,-0.06956197,0.03013326,0.02150778,-0.0550484,-0.0261788,0.009985867,-0.1512847,0.02564156,0.04319289,-0.08713885,-0.002604677,-0.02203224,-0.2278587],[-0.1220507,-0.04531354,0.04875594,-0.08178659,-0.1013412,-0.0726969,0.007503537,-0.06343133,0.02364912,0.02824844,-0.1441671,0.06345133,-0.07451145,-0.02469812,-0.04433631,0.05764384,0.1067394,0.04646101,-0.09455499,0.0640397,-0.08731768,-0.04884395,-0.07987945,-0.0140677,0.04737818,-0.09971828,0.02786357,-0.006402432,-0.06697319,0.04610695,-0.05047724,-0.05158972,-0.1443309,0.04464193,0.009519417,-0.03015217],[0.2099104,-0.1684076,-0.06805251,0.06560369,-0.00273183,-0.1095038,0.07329796,-0.2117694,0.03512529,-0.0270202,0.1174313,0.1042002,0.08940581,0.03746595,-0.1914256,0.0337384,-0.08731297,-0.2062627,-0.1225063,0.01032534,0.05109185,-0.1922104,0.1090152,-0.07567108,0.01740379,0.06373741,-0.009417512,-0.1000395,-0.1000344,0.09577063,0.2168733,-0.03565064,0.08609559,0.0949103,0.04231618,0.122704],[-0.07008569,0.03606128,-0.02093572,-0.09891725,-0.1553714,-0.164199,0.02661882,-0.09980717,0.02760278,0.07249299,-0.1128198,-0.02175166,-0.02122776,0.02978821,0.09451763,0.128157,0.01287179,0.04034975,-0.00395237,-0.112475,0.1244219,-0.06161802,-0.09204714,0.1383796,0.06877777,0.01639783,-0.09142823,0.08930247,-0.169492,-0.03355544,0.1006837,0.1070534,-0.1027272,-0.003553889,0.04331676,-0.03296719],[-0.07714117,-0.01951007,-0.02525099,-0.0219882,-0.005607223,-0.03016032,0.07775729,-0.281825,-0.04191865,-0.04543306,0.1023309,0.04928445,-0.03374882,-0.0998207,-0.2000202,-0.1464705,0.05325254,0.002193074,-0.04504349,-0.04690605,-0.05313255,-0.08942635,-0.1862716,-0.04621171,0.03478831,0.01742615,3.250123E-05,-0.02268412,0.08652928,-6.308066E-05,-0.04807549,-0.0223104,-0.03409399,0.03688982,-0.03857144,-0.1223418],[0.07727166,-0.002472852,0.07254371,-0.06599981,-0.173847,-0.1799199,0.07627889,-0.06704186,-0.007101597,-0.1427422,0.04551864,-0.07507533,0.01453323,0.1299603,-0.02196048,0.1103626,-0.007494072,0.01750851,-0.0131066,